benchmarks/casesOF/3D/stationaryBubble/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

//- Number of cells along x direction
nx 32;

//- Number of cells along y direction = nx

//- Number of cells along z direction = nx

vertices        
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($nx $nx $nx) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    xMin
    {
        type symmetry;
        faces
        (
          (0 4 7 3)
        );
    }
    xMax
    {
        type symmetry;
        faces
        (
          (2 6 5 1)
        );
    }
    yMin
    {
        type symmetry;
        faces
        (
          (1 5 4 0)
        );
    }
    yMax
    {
        type symmetry;
        faces
        (
          (3 7 6 2)
        );
    }
    zMin
    {
        type symmetry;
        faces
        (
          (0 3 2 1)
        );
    }
    zMax
    {
        type symmetry;
        faces
        (
          (4 5 6 7)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
