benchmarks/casesOF/3D/stationaryBubble/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

   "alpha.phase1.*"
    {
	advectionScheme isoAdvection; //MULESScheme;
	reconstructionScheme mycCartesian; //youngCartesian; //plicRDF; // isoAlpha; // isoAlpha
	//reconstructionScheme plicRDF; // isoAlpha; // isoAlpha

      isoFaceTol      1e-10;
      surfCellTol     1e-8;
      nAlphaBounds    3;
      snapTol         1e-12;
      clip            true;
      //writeSurfCells  true;
      //writeBoundedCells true;
      writeIsoFaces   false;
      //reconstructionScheme isoAlpha;
      
      nAlphaCorr      1;
      nAlphaSubCycles 1;
      cAlpha          1;
    }

    pcorr
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-10;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-07;
        relTol          0.001;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-8; /* Should be 1 to 2 orders of 
                                 magnitude smaller than 
                                 alpha.phase1.*.surfCellTol */
        relTol          0;
    }

    "(U|k|epsilon).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}

// ************************************************************************* //
